
{
  "shared": {
    "open": "открыть",
    "buy": "купить",
    "close": "закрыть",
    "price": "Стоимость",
    "back": "Вернуться",
    "continue": "продолжить"
  },
  "gallery": {
    "name": "Надежда Навроцкая",
    "gallery": "Галерея",
    "galleryN": "Галерея Надежды Навроцкой",
    "text1": "Художник, фотограф, психолог и арт-терапевт, автор проекта «Metamorfosi». В галерее вы можете найти и приобрести графические и живописные работы Надежды.",
    "text2": "«Изобразительное искусство для меня — не только способ показать мир, в котором я живу, но и глубокая терапия. Дать возможность людям увидеть себя глубже через портреты, которые я создаю. Увидеть по-новому знакомые города и обрести места силы, получить вместе с картиной ресурс и источник энергии. Иметь возможность погрузить в картину, прожить травму и выйти обновленным».",
    "text3": "«Живопись для нее — это то, что она хочет делать больше всего… «Арно» — это проблеск в сумерках, который очаровывает… как и все ее работы, всегда окутанные сумрачным светом… Но также у нее есть и пылкие реалистичные портреты, как во вкусной серии «Пизане» («Лилиана», «Мартина»...)",
    "text4": "Плинио Перилли, арт-критик, Рим, Италия.",
    "description": "В нашей виртуальной галерее вы найдете \"постоянную экспозицию\" - живописные и графические работы Надежды Навроцкой",
    "landscape": "Пейзажи",
    "cityLandscapes": "Городские Пейзажи",
    "portraits": "Портреты",
    "stillLifes": "Натюрморты",
    "different": "Разное",
    "artObjects": "Арт-объекты",
    "photo": "Фото",
    "changeRubric": "Сменить рубрику",
    "priceOriginal": "Стоимость оригинала",
    "buyPrint": "Купить принт на холсте",
    "print": "Принт на холсте",
    "textDelivery": "Доставка и страховка осуществляются за счет покупателя",
    "textDelivery1": "Срок отправки картины за пределы Евросоюза - 2-3 недели.",
    "textStripe": "Для обработки платежа Вы будете перенаправлены на страницу платформы Stripe",
    "textThank": "Благодарим за оплату!",
    "textThank1": "Вы приобрели картину Надежды Навроцкой",
    "textThank2": "По вопросам доставки мы свяжемся с вами по электронной почте в течение суток",
    "galleryNN": "Галерея Надежды Навроцкой",
    "galleryNNDescription": "Художник всегда рисует свой автопортрет"
  }
}
